INSERT INTO blog.posts (title, text_preview, text)
VALUES ('Результаты матчей РПЛ 6 апреля',
        'Сегодня, 6 апреля, прошли три матча 23-го тура Российской Премьер-Лиги сезона-2024/2025. «Чемпионат» предлагает ознакомиться с результатами встреч, состоявшихся в этот день.',
        '«Динамо» Махачкала — «Химки» — 4:1;
«Ростов» — «Спартак» — 0:3;
ЦСКА — «Динамо» Москва — 3:1.
Турнирную таблицу Российской Премьер-Лиги сезона-2024/2025 возглавляет «Краснодар». Команда набрала 52 очка после 23 матчей. На второй строчке располагается московский «Спартак», заработав 47 очков. Тройку лидеров замыкает санкт-петербургский «Зенит» (47). В зоне вылета располагаются «Оренбург» (14) и «Факел» (15).'),
       ('Определилась первая пара второго раунда плей-офф КХЛ',
        'После выхода московского «Динамо» в 1/4 финала Кубка Гагарина определилась первая пара второго раунда: челябинский «Трактор» сыграет с минским «Динамо».',
        'Два возможных варианта сетки второго раунда:
   При условии победы «Салавата Юлаева» в серии:
   Группа А – серии стартуют 11 апреля
   «Локомотив» (1) – «Авангард» (6);
   «Салават Юлаев (2) — «Спартак» (3);
   Группа Б – серии стартуют 12 апреля
   «Трактор» (1) – «Динамо» Минск (4);
   «Динамо» Москва (2) – «Автомобилист» (4) / «Ак Барс» (5).
   При условии победы «Сибири» в серии:
   Группа А – серии стартуют 11 апреля
   «Локомотив» (1) – «Сибирь» (7);
   «Спартак» (3) — «Автомобилист» (4) / «Ак Барс» (5).
   Группа Б – серии стартуют 12 апреля
   «Трактор» (1) – «Динамо» Минск (4);
   «Динамо» Москва (2) – «Авангард» (6)
   Седьмой матч в паре «Автомобилист» — «Ак Барс» пройдёт завтра, 7 апреля.'),
       ('Он хорошо играет на грунте». Медведев — о предстоящем матче с Хачановым в Монте-Карло',
        'Чемпион US Open – 2021 российский теннисист Даниил Медведев высказался о предстоящей встрече со своим соотечественником Кареном Хачановым в первом круге «Мастерса» в Монте-Карло.',
        'Очень нравится играть здесь, в Монте-Карло. Первый турнир на грунте, всегда интересно увидеть, где ты находишься, как ты можешь его сыграть. Кстати, в принципе, у меня довольно часто получалось не так плохо играть здесь, поэтому посмотрим.'),
       ('Мовсар Евлоев проведёт следующий бой в UFC против дебютанта — инсайдер',
        'Известный российский журналист и инсайдер Давид Багдасарян сообщил в своём телеграм-канале, что четвёртый номер рейтинга UFC в полулёгком весе непобеждённый Мовсар Евлоев проведёт следующий поединок против дебютанта и бывшего бойца Bellator и PFL американца Аарона Пико.',
        'Согласно имеющейся информации, их поединок состоится на турнире UFC Fight Night 256, который пройдёт 17 мая в Лас-Вегасе (штат Невада, США).
   Мовсару Евлоеву 30 лет. Россиянин дебютировал как профессиональный боец смешанного стиля в 2014 году, с 2019-го выступает в UFC. Всего на счету Евлоева в престижнейшей организации мира девять побед и ни одного поражения.
   Аарону Пико 28 лет. В своём профессиональном рекорде он имеет 13 побед, из которых 11 были одержаны досрочно, и четыре поражения.'),
       ('Леброн рассказал о своём физическом состоянии перед возможным участием в плей-офф НБА',
        'Четырёхкратный чемпион Национальной баскетбольной ассоциации (НБА), а также лидер и лёгкий форвард калифорнийского клуба «Лос-Анджелес Лейкерс» Леброн Джеймс рассказал о своём физическом состоянии перед возможным выходом команды в плей-офф североамериканской организации.',
        '«Моё сегодняшнее выступление стало лучшим с момента травмы паха, это точно. Я оказывал давление, пытался найти свой ритм.
   Сегодня мне хорошо удавалось делать броски в прыжке и штрафные. Наверное, сейчас ещё рано говорить, но физически чувствую себя лучше, чем когда-либо. Надеюсь, получится поддерживать эту форму», — приводит слова Джеймса портал Fadeaway World.'),
       ('Виталий Петров одним словом отреагировал на рекорд Александр Овечкина',
        'Бывший гонщик Формулы-1 Виталий Петров отреагировал на рекорд Национальной хоккейной лиги по забитым голам российского хоккеиста, капитана и нападающего «Вашингтон Кэпиталз» Александра Овечкина.',
        '«Лучший», — написал в своих социальных сетях Виталий Петров.
   Овечкин в матче регулярки с «Нью-Йорк Айлендерс» стал автором заброшенной шайбы и побил рекорд легендарного канадца Уэйна Гретцки. На счету Овечкина стало 895 заброшенных шайб. Гретцки за карьеру в регулярных чемпионатах стал автором 894 голов.
   Рекорд великого канадца продержался 26 лет. Он установил его в 1999 году, забив 802-ю шайбу в карьере и опередив Горди Хоу (801).'),
       ('Антон Смольский во второй раз подряд выиграл общий зачёт Кубка Содружества',
        'Белорусский биатлонист Антон Смольский второй раз подряд стал победителем общего зачёта Кубка Содружества — 2024/2025. В его активе 1919 очков. ',
        'Белорусский биатлонист Антон Смольский второй раз подряд стал победителем общего зачёта Кубка Содружества — 2024/2025. В его активе 1919 очков. Второе место по итогам сезона занял Карим Халили, который заработал 1726 баллов. Тройку сильнейших замкнул Антон Бабиков (1573).'),
       ('«Один глаз видит, а второй нет». Александр Большунов рассказал о проблемах со зрением',
        'Трёхкратный олимпийский чемпион лыжник Александр Большунов рассказал о проблемах со зрением.',
        '«Во время тренировок в начале сезона, когда ковидом переболел, выходил на тренировку и даже осложнения замечал по зрению. Один глаз видит, а второй не видит. Для меня это было максимально непросто, потому что очень сильно себя загонял. Здоровье на первом месте, гонки это гонки, но когда ты выходишь и понимаешь, что один глаз начинает видеть хуже, особенно когда чуть‑чуть темнеет. Думаешь, а нужно ли дальше?» — сказал Большунов в эфире «Матч ТВ».');

INSERT INTO blog.images(path, post_id)
VALUES ('/uploads/images/football.jpg', 1),
       ('/uploads/images/hockey.png', 2),
       ('/uploads/images/tennis.png', 3),
       ('/uploads/images/boxing.png', 4),
       ('/uploads/images/basketball.png', 5),
       ('/uploads/images/f1.png', 6),
       ('/uploads/images/biatlon.png', 7),
       ('/uploads/images/ski.png', 8);